refined docs
